Autodesk.Revit.DB.Architecture.TopographySurface.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.PolymeshFacet})
Creates a new topography surface element from facets and adds it to the document.
Remarks:
The document will be regenerated during the creation of this topography surface element.
The topography surface created by facet cannot modify its triangle points and facets.
document:
The document to be modified.
points:
A collection of points.
The points represent an enclosed area in the XY plane.
facets:
Triangle facets composing a polygon mesh.
Every facet contains 3 integers representing vertex indices.
Returns:
The new topography surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
There are invalid facets. Facets with more than two points with same x, y are not allowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019.2